local L = LibStub("AceLocale-3.0"):NewLocale("HandyNotes_TravelGuide (Classic)", "ruRU", false, true)

if not L then return end
-- Russian translation by Кеаллах RU-Змейталак https://www.curseforge.com/members/arrogant_dreamer
-- and Hollicsh ( https://www.curseforge.com/members/hollicsh )
if L then

----------------------------------------------------------------------------------------------------
-----------------------------------------------CONFIG-----------------------------------------------
----------------------------------------------------------------------------------------------------

L["config_plugin_name"] = "Путеводитель"
L["config_plugin_desc"] = "Отображает местоположение дирижаблей кораблей и лодок на карте мира и миникарте."

L["config_tab_general"] = "Общие настройки"
L["config_tab_scale_alpha"] = "Масштаб / Прозрачность"
--L["config_scale_alpha_desc"] = "PH"
L["config_icon_scale"] = "Масштаб значка"
L["config_icon_scale_desc"] = "Размер значков"
L["config_icon_alpha"] = "Прозрачность значка"
L["config_icon_alpha_desc"] = "Прозрачность значков"
L["config_what_to_display"] = "Что отображать?"
L["config_what_to_display_desc"] = "Эти настройки определяют, какие значки будут отображаться."

L["config_boat"] = "Корабль"
L["config_boat_desc"] = "Показать расположение кораблей."
L["config_boat_alliance"] = "Корабль Альянса"
L["config_boat_alliance_desc"] = "Показать расположение кораблей Альянса."

L["config_zeppelin"] = "Дирижабль"
L["config_zeppelin_desc"] = "Показать расположение дирижаблей."
L["config_zeppelin_horde"] = "Дирижабль Орды"
L["config_zeppelin_horde_desc"] = "Показать расположение Дирижаблей Орды."

L["config_tram"] = "Подземный поезд"
L["config_tram_desc"] = "Показать Подземный поезд из Штормград в Стальгорн."

L["config_note"] = "Заметка"
L["config_note_desc"] = "Показать дополнительные заметки узла, когда они доступны."

L["config_easy_waypoints"] = "Легкие точки маршрута"
L["config_easy_waypoints_desc"] = "Активирует упрощенное создание точек маршрута.\nПозволяет Вам установить путевую точку, щелкнув ПКМ, и получить доступ к дополнительным параметрам, нажав CTRL + ПКМ."
L["config_easy_waypoints_requires"] = "Требуется"

L["config_restore_nodes"] = "Восстановить скрытые узлы"
L["config_restore_nodes_desc"] = "Восстановить все узлы, которые были скрыты через контекстное меню."
L["config_restore_nodes_print"] = "Все скрытые узлы восстановлены"

----------------------------------------------------------------------------------------------------
-------------------------------------------------DEV------------------------------------------------
----------------------------------------------------------------------------------------------------

L["dev_config_tab"] = "РАЗРАБОТКА"

L["dev_config_force_nodes"] = "Силовые узлы"
L["dev_config_force_nodes_desc"] = "Принудительно отображать все узлы независимо от класса, фракции или ковенанта."

L["dev_config_show_prints"] = "Показать печать()"
L["dev_config_show_prints_desc"] = "Показывать сообщения print() в окне чата."

----------------------------------------------------------------------------------------------------
-----------------------------------------------HANDLER----------------------------------------------
----------------------------------------------------------------------------------------------------

--==========================================CONTEXT_MENU==========================================--

L["handler_context_menu_addon_name"] = "HandyNotes: Путеводитель"
L["handler_context_menu_add_tomtom"] = "Добавить в TomTom"
L["handler_context_menu_hide_node"] = "Скрыть этот узел"

----------------------------------------------------------------------------------------------------
----------------------------------------------DATABASE----------------------------------------------
----------------------------------------------------------------------------------------------------

L["Zeppelin to Orgrimmar"] = "Дирижабль в Оргриммар"
L["Zeppelin to Stranglethorn Vale"] = "Дирижабль в Тернистую долину"
L["Zeppelin to Undercity"] = "Дирижабль в Подгород"
L["Deeprun Tram to Ironforge"] = "Подземный поезд в Стальгорн"
L["Deeprun Tram to Stormwind"] = "Подземный поезд в Штормград"
L["Boat to Auberdine"] = "Корабль в Аубердин"
L["Boat to Booty Bay"] = "Корабль в Пиратскую бухту"
L["Boat to Darnassus"] = "Корабль в Дарнас"
L["Boat to Menethil Harbor"] = "Корабль в Гавань Менетилов"
L["Boat to Ratchet"] = "Корабль в Кабестан"
L["Boat to Theramore Isle"] = "Корабль на остров Терамор"
end